# Consider the following data frame containing a family name, gender of the family member and her/his monthly income in each record.

## Write a program in Python using Pandas to perform the following:

In [1]:
import pandas as pd
import numpy as np

data = {"Name" : ["Shah","Vats", "Vats", "Kumar","Vats","Kumar", "Shah", "Shah", "Kumar", "Vats"], 
        "Gender" : ["Male","Male","Female","Female","Female","Male","Male","Female","Female","Male"],
        "MonthlyIncome": [114000.00, 65000.00, 43150.00, 69500.00, 155000.00, 103000.00, 55000.00, 112400.00, 81030.00, 71900.00]}
df = pd.DataFrame(data)
df

    Name  Gender  MonthlyIncome
0   Shah    Male       114000.0
1   Vats    Male        65000.0
2   Vats  Female        43150.0
3  Kumar  Female        69500.0
4   Vats  Female       155000.0
5  Kumar    Male       103000.0
6   Shah    Male        55000.0
7   Shah  Female       112400.0
8  Kumar  Female        81030.0
9   Vats    Male        71900.0

## a. Calculate and display familywise gross monthly income.

In [2]:
data1 = df.loc[:,["Name", "Gender", "MonthlyIncome"]]
data1

    Name  Gender  MonthlyIncome
0   Shah    Male       114000.0
1   Vats    Male        65000.0
2   Vats  Female        43150.0
3  Kumar  Female        69500.0
4   Vats  Female       155000.0
5  Kumar    Male       103000.0
6   Shah    Male        55000.0
7   Shah  Female       112400.0
8  Kumar  Female        81030.0
9   Vats    Male        71900.0

## b. Calculate and display the member with the highest monthly income in a family.

In [3]:
data1.groupby("Name")["MonthlyIncome"].sum() 
data1.groupby("Name")["MonthlyIncome"].max()

Name
Kumar    103000.0
Shah     114000.0
Vats     155000.0
Name: MonthlyIncome, dtype: float64

## c. Calculate and display monthly income of all members with income greater than Rs. 60000.00.

In [4]:
data1[data1["MonthlyIncome"]>=60000.00]

    Name  Gender  MonthlyIncome
0   Shah    Male       114000.0
1   Vats    Male        65000.0
3  Kumar  Female        69500.0
4   Vats  Female       155000.0
5  Kumar    Male       103000.0
7   Shah  Female       112400.0
8  Kumar  Female        81030.0
9   Vats    Male        71900.0

## d. Calculate and display the average monthly income of the female members in the Shah family.

In [5]:
data1.groupby(["Name", "Gender"])[["MonthlyIncome"]].mean().query("Name =='Shah' and Gender =='Female'")

             MonthlyIncome
Name Gender
Shah Female       112400.0